testCase/system/controlDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         5000;

deltaT          1;

writeControl    timeStep;

writeInterval   5000;

purgeWrite      0;

writeFormat     ascii;

writePrecision  12;

writeCompression uncompressed;

timeFormat      general;

timePrecision   12;

runTimeModifiable true;

// To access the profile1DfixedValue boundary condition
//libs ("libOpenFoamTurbo.so");

/*functions
{
    probes1
    {
        type            probes;
        functionObjectLibs ( "libsampling.so" );
        enabled         true;
        outputControl   timeStep;
        outputInterval  1;
        probeLocations
        (
	   ( 0.05 0 0.185 ) 
        );
        fields
        (
             Omega  K1 K2 K3 K4 OT TauH
        );
   }
}*/



// ************************************************************************* //
