testCase/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField  uniform (1 1 1); 

boundaryField
{
    INLET
    {
        type		fixedValue;
	/*type              profile1DfixedValue;
        fileName          "U_IN.csv";
        fileFormat        "turboCSV";
        interpolateCoord  "R";
        fieldName         "Velocity";*/
        value           nonuniform List<vector>
2112
(
(0.27811156696 0.260335614223 1.47792340335)
(0.31162416289 0.255691151268 1.56385819664)
(0.344551083074 0.246920153862 1.64453532243)
(0.376293387457 0.23406372317 1.71924874823)
(0.406262352434 0.217254917082 1.78735121614)
(0.433893425527 0.196715951427 1.84825795077)
(0.458659561678 0.172753324615 1.90144998088)
(0.480083585263 0.145750967994 1.94647684554)
...
)

;	
    }
    OUTLET
    {
        type              zeroGradient;
	/*type            profile1DfixedValue;
        fileName          "CFX_OUT.csv";
        fileFormat        "turboCSV";
        interpolateCoord  "R";
        fieldName         "Velocity";*/
    }
    PIPE_WALL
    {
        type              fixedValue;
        value             uniform (0 0 0);
    }
    
}


// ************************************************************************* //
