testCase/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "2";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0; 
;

boundaryField
{
    INLET
    {
        type              zeroGradient;
	/*type 		  fixedValue;
	value             uniform 99637.5;*/
	/*type            profile1DfixedValue;
        fileName          "CFX_IN.csv";
        fileFormat        "turboCSV";
        interpolateCoord  "R";
        fieldName         "Pressure";
	fieldScaleFactor  1/rho;*/
    }
    OUTLET
    {
        type              fixedValue;
        value             uniform 0;
	/*type            profile1DfixedValue;
        fileName          "CFX_OUT.csv";
        fileFormat        "turboCSV";
        interpolateCoord  "R";
        fieldName         "Pressure";
	fieldScaleFactor  1/rho;*/
    }
    PIPE_WALL
    {
        type            zeroGradient;
    }
    
}


// ************************************************************************* //
