testCase/0.orig/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.5;

boundaryField
{
    INLET
    {
        type            fixedValue;
        value           nonuniform List<scalar> 
2112
(
0.554944142558
0.587211721559
0.617505103677
0.645559181391
0.67113091642
0.694000731965
0.71397375998
0.730880857293
...
)
;
    }
    OUTLET
    {
        type            zeroGradient;
    }
    PIPE_WALL
    {
        type            epsilonWallFunction;
        refValue        uniform 0;
        value           uniform 0.5;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
    }
}


// ************************************************************************* //
