testCase/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.01;

boundaryField
{
    INLET
    {
        type            fixedValue;
        value           nonuniform List<scalar> 
2112
(
0.0127359391695
0.013476478427
0.0141717099689
0.0148155495914
0.0154024195785
0.0159272806541
0.0163856606068
0.0167736776096
...
)
;
    }
    OUTLET
    {
        type            zeroGradient;
    }
    PIPE_WALL
    {
        type            kqRWallFunction;
        value           uniform 0.01;
    }
}


// ************************************************************************* //
