testCase/system/fvSolution
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver           PCG;
        preconditioner   DIC;
        tolerance        1e-07;
        relTol           0.01;
	/*solver          GAMG;
        tolerance       1e-08;
        relTol          0.01;
        smoother        GaussSeidel;
        nPreSweeps      0;
        nPostSweeps     2;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 10;
        agglomerator    faceAreaPair;
        mergeLevels     1;*/
    };

    U
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        nSweeps         2;
        tolerance       1e-08;
        relTol          0.1;
    }

    k
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        nSweeps         2;
        tolerance       1e-08;
        relTol          0.1;

    }
    epsilon
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        nSweeps         2;
        tolerance       1e-08;
        relTol          0.1;
    }
   /* U PBiCG
    {
        preconditioner   DILU;
        tolerance        1e-06;
        relTol           0.1;
    };
    k PBiCG
    {
        preconditioner   DILU;
        tolerance        1e-06;
        relTol           0.1;
    };
    epsilon PBiCG
    {
        preconditioner   DILU;
        tolerance        1e-06;
        relTol           0.1;
    };*/
    
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    pRefCell                 0;
    pRefValue                0;
}

relaxationFactors
{
    p               0.4;
    U               0.4;
    k               0.7;
    epsilon         0.7;
}


// ************************************************************************* //
