testCase/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5.x                                 |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

/* Koord.sistem mreze je aksijalno pomeren za z/D=4.3 zato je:
Z/D=4.30   ->    z/D=0.00;   ->   z=0.00*0.07=0.000 m;
Z/D=7.70   ->    z/D=3.40;   ->   z=3.40*0.07=0.238 m;
Z/D=11.5   ->    z/D=7.20;   ->   z=7.20*0.07=0.504 m;
Z/D=21.3   ->    z/D=17.0;   ->   z=17.0*0.07=1.190 m;
Z/D=28.1   ->    z/D=23.8;   ->   z=23.8*0.07=1.666 m;
Z/D=34.9   ->    z/D=30.6;   ->   z=30.6*0.07=2.142 m;
*/

interpolationScheme cellPoint;

setFormat     raw;

sets      
(

    z043   //zadato kao granichni uslov!
    {
        type            uniform;
        axis            x;         //z-axis in plot
        start           (-0.035 0   0.000);
        end             ( 0.035 0   0.000);
        nPoints         500;
    }

   z077
    {
        type            uniform;
        axis            x;         //z-axis in plot
        start           (-0.035 0   0.238);
        end             ( 0.035 0   0.238);
        nPoints         500;
    }

    z115
    {
        type            uniform;
        axis            x;         //z-axis in plot
        start           (-0.035 0   0.504);
        end             ( 0.035 0   0.504);
        nPoints         500;
    }

    z213
    {
        type            uniform;
        axis            x;         //z-axis in plot
        start           (-0.035 0   1.190);
        end             ( 0.035 0   1.190);
        nPoints         500;
    }
	
    z281
    {
        type            uniform;
        axis            x;         //z-axis in plot
        start           (-0.035 0   1.666);
        end             ( 0.035 0   1.666);
        nPoints         500;
    }

    z349
    {
        type            uniform;
        axis            x;         //z-axis in plot
        start           (-0.035 0   2.142);
        end             ( 0.035 0   2.142);
        nPoints         500;
    }

);


surfaceFormat foamFile;

surfaces
(
inlet
    {
        type            patch;
        patchName       INLET;
        interpolate     false;
        triangulate	false;
    }
);

fields          
(
     U  /* epsilon  k K1 K2 K3 K4 K5 K6 K7
	Rxx Ryy Rzz Rxy Rxz Ryz*/
);

// ************************************************************************* //
